Белгипрозем_2017/src/Documents/мАктирование/мАктирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мАктирование</name>
  <registerRecords>AccumulationRegister.Сметы</registerRecords>
  <registerRecords>AccumulationRegister.УчетПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.НачислениеЗП</registerRecords>
  <registerRecords>AccumulationRegister.УчетДоговоров</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Зарплата</name>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КТУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент понижающий или повышающий</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбоснованиеКоэффициента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАкта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеОсновноеПодразделение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовоеНачисление</name>
      <comment>Сумма сделки без учета +/- коэф.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРабот</name>
      <type>
        <types>CatalogRef.мОбъектыРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Акты</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАкта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаАкта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПрочих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Акт</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыРабот</name>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРабот</name>
      <type>
        <types>CatalogRef.мОбъектыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПрочих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗИС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/InformationRegisters/мУсловияДоговоров/мУсловияДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мУсловияДоговоров</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПроцентПредоплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчетДатыПодписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетДатыПредоставленияДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетДатыВозвратаДоговора</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетДатыПредоплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетДатыВыполненияПредыдущегоЭтапа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетДатыПредоставленияРешения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/мСведенияОСотрудниках/мСведенияОСотрудниках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мСведенияОСотрудниках</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.мВидыЗанятости</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮрФизЛицо</name>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредпринимательНеРезидент</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Catalogs/мВидыДатДоговоров/мВидыДатДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мВидыДатДоговоров</name>
  <predefined>
    <items>
      <name>ДатаВозвратаДоговора</name>
      <description>Дата возврата договора</description>
    </items>
    <items>
      <name>ДатаВозобновленияРабот</name>
      <description>Дата возобновления работ</description>
    </items>
    <items>
      <name>ДатаВыполнения</name>
      <description>Дата выполнения</description>
    </items>
    <items>
      <name>ДатаЗакрытия</name>
      <description>Дата закрытия</description>
    </items>
    <items>
      <name>ДатаОплаты</name>
      <description>Дата оплаты</description>
    </items>
    <items>
      <name>ДатаПодписанияЗаказчиком</name>
      <description>Дата подписания заказчиком</description>
    </items>
    <items>
      <name>ДатаПредоставленияДокументов</name>
      <description>Дата предоставления документов</description>
    </items>
    <items>
      <name>ДатаПриостановленияРабот</name>
      <description>Дата приостановления работ</description>
    </items>
    <items>
      <name>ДатаПродления</name>
      <description>Дата продления</description>
    </items>
    <items>
      <name>ДатаРегистрации</name>
      <description>Дата регистрации</description>
    </items>
    <items>
      <name>ПлановыйСрок</name>
      <description>Плановый срок</description>
    </items>
  </predefined>
</mdclass:Catalog>

Белгипрозем_2017/src/Documents/мАктирование/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ВидДокумента", Справочники.ВидыВнутреннихДокументов.АктВыполненныхРабот);
	Запрос.УстановитьПараметр("ВидДоговораГКИ", Справочники.ВидыВнутреннихДокументов.ДоговорГКИ);
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	              |	ВедомостьАктированияАкты.Договор.Корреспондент КАК Корреспондент,
	              |	ВедомостьАктированияАкты.Договор КАК Договор,
	              |	ВедомостьАктированияАкты.Договор.ВидДокумента КАК ВидДоговора,
	              |	ВедомостьАктированияАкты.ЭтапДоговора КАК ЭтапДоговора,
	              |	ВедомостьАктированияАкты.ЭтапДоговора.Подразделение КАК Подразделение,
	              |	ВедомостьАктированияАкты.ЭтапДоговора.СтавкаНДС КАК СтавкаНДС,
	              |	ВедомостьАктированияАкты.ЭтапДоговора.ОсвобождениеОтНДС КАК ОсвобождениеОтНДС,
	              |	ВедомостьАктированияАкты.ДатаАкта КАК Период,
	              |	ВедомостьАктированияАкты.ДатаАкта КАК ДатаДокумента,
	              |	ВедомостьАктированияАкты.Сумма КАК Сумма,
	              |	ВедомостьАктированияАкты.НДС КАК НДС,
	              |	ВедомостьАктированияАкты.НомерАкта КАК НомерДокумента
	              |ИЗ
	              |	Документ.мАктирование.Акты КАК ВедомостьАктированияАкты
	              |ГДЕ
	              |	ВедомостьАктированияАкты.Ссылка = &Ссылка
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ЗНАЧЕНИЕ(Справочник.мВидыДатДоговоров.ДатаВыполнения) КАК ВидДатыДоговора,
	              |	ВедомостьАктированияАкты.Ссылка КАК Основание,
	              |	ВедомостьАктированияАкты.ЭтапДоговора КАК ЭтапДоговора,
	              |	ВедомостьАктированияАкты.ДатаАкта КАК Период,
	              |	ВедомостьАктированияАкты.Акт КАК Акт,
	              |	ВедомостьАктированияАкты.Акт.ДатаРегистрации КАК ДатаРегистрацииАкта,
	              |	ВедомостьАктированияАкты.ДатаАкта КАК Дата,
	              |	ВЫБОР
	              |		КОГДА ВедомостьАктированияАкты.Договор.Корреспондент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	              |			ТОГДА ИСТИНА
	              |		ИНАЧЕ ЛОЖЬ
	              |	КОНЕЦ КАК ЭтоФизЛицо,
	              |	мУсловияДоговоровСрезПоследних.УчетДатыВыполненияПредыдущегоЭтапа,
	              |	ВедомостьАктированияАкты.ЭтапДоговора.НомерЭтапа КАК НомерЭтапа,
	              |	ВедомостьАктированияАкты.ЭтапДоговора.Владелец КАК Договор
	              |ИЗ
	              |	Документ.мАктирование.Акты КАК ВедомостьАктированияАкты
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мУсловияДоговоров.СрезПоследних(
	              |				,
	              |				ЭтапДоговора В
	              |					(ВЫБРАТЬ
	              |						мАктированиеАкты.ЭтапДоговора
	              |					ИЗ
	              |						Документ.мАктирование.Акты КАК мАктированиеАкты
	              |					ГДЕ
	              |						мАктированиеАкты.Ссылка = &Ссылка)) КАК мУсловияДоговоровСрезПоследних
	              |		ПО ВедомостьАктированияАкты.ЭтапДоговора = мУсловияДоговоровСрезПоследних.ЭтапДоговора
	              |ГДЕ
	              |	ВедомостьАктированияАкты.Ссылка = &Ссылка
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	мАктированиеЗарплата.Исполнитель КАК Исполнитель,
	              |	мАктированиеАкты.ДатаАкта КАК ДатаАкта,
	              |	мАктированиеЗарплата.НомерАкта КАК НомерАкта,
	              |	мАктированиеЗарплата.Начислено КАК Начислено,
	              |	мАктированиеЗарплата.БазовоеНачисление КАК БазовоеНачисление,
	              |	МАКСИМУМ(мСведенияОСотрудниках.Период) КАК Период,
	              |	мАктированиеЗарплата.Подразделение КАК Подразделение,
	              |	мАктированиеЗарплата.ОбъектРабот КАК ОбъектРабот
	              |ПОМЕСТИТЬ Данные
	              |ИЗ
	              |	Документ.мАктирование.Зарплата КАК мАктированиеЗарплата
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.мАктирование.Акты КАК мАктированиеАкты
	              |		ПО мАктированиеЗарплата.НомерАкта = мАктированиеАкты.НомерАкта
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мСведенияОСотрудниках КАК мСведенияОСотрудниках
	              |		ПО (мСведенияОСотрудниках.Период <= мАктированиеАкты.ДатаАкта)
	              |			И мАктированиеЗарплата.Исполнитель = мСведенияОСотрудниках.Пользователь
	              |ГДЕ
	              |	мАктированиеАкты.Ссылка = &Ссылка
	              |	И мАктированиеЗарплата.Ссылка = &Ссылка
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	мАктированиеЗарплата.Исполнитель,
	              |	мАктированиеАкты.ДатаАкта,
	              |	мАктированиеЗарплата.Начислено,
	              |	мАктированиеЗарплата.БазовоеНачисление,
	              |	мАктированиеЗарплата.НомерАкта,
	              |	мАктированиеЗарплата.Подразделение,
	              |	мАктированиеЗарплата.ОбъектРабот
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	Данные.Исполнитель КАК Исполнитель,
	              |	Данные.НомерАкта КАК НомерАкта,
	              |	СУММА(Данные.Начислено) КАК Начислено,
	              |	СУММА(Данные.БазовоеНачисление) КАК БазовоеНачисление,
	              |	мСведенияОСотрудниках.Должность КАК Должность,
	              |	мСведенияОСотрудниках.Оклад КАК Оклад,
	              |	Данные.Подразделение КАК Подразделение,
	              |	Данные.ОбъектРабот КАК ОбъектРабот
	              |ПОМЕСТИТЬ Начисления
	              |ИЗ
	              |	Данные КАК Данные
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мСведенияОСотрудниках КАК мСведенияОСотрудниках
	              |		ПО Данные.Исполнитель = мСведенияОСотрудниках.Пользователь
	              |			И (мСведенияОСотрудниках.Период = Данные.Период)
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	Данные.Исполнитель,
	              |	Данные.НомерАкта,
	              |	мСведенияОСотрудниках.Должность,
	              |	мСведенияОСотрудниках.Оклад,
	              |	Данные.Подразделение,
	              |	Данные.ОбъектРабот
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	              |	мАктированиеЗарплата.Исполнитель,
	              |	ЕСТЬNULL(Начисления.Начислено, 0) КАК Сумма,
	              |	ЕСТЬNULL(Начисления.БазовоеНачисление, 0) КАК БазовоеНачисление,
	              |	Начисления.Должность,
	              |	Начисления.Оклад,
	              |	Начисления.ОбъектРабот,
	              |	мАктированиеЗарплата.ОбъектРабот КАК ОбъектРабот,
	              |	мАктированиеЗарплата.ЭтапДоговора,
	              |	мАктированиеЗарплата.Подразделение КАК Подразделение,
	              |	мАктированиеЗарплата.Ссылка.Дата КАК Период,
	              |	мАктированиеЗарплата.КТУ,
	              |	мАктированиеЗарплата.Коэффициент
	              |ИЗ
	              |	Документ.мАктирование.Зарплата КАК мАктированиеЗарплата
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Начисления КАК Начисления
	              |		ПО мАктированиеЗарплата.Исполнитель = Начисления.Исполнитель
	              |			И мАктированиеЗарплата.НомерАкта = Начисления.НомерАкта
	              |			И мАктированиеЗарплата.ОбъектРабот = Начисления.ОбъектРабот
	              |ГДЕ
	              |	мАктированиеЗарплата.Ссылка = &Ссылка
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ РАЗЛИЧНЫЕ
	              |	мАктированиеЗарплата.ЭтапДоговора КАК ЭтапДоговора,
	              |	мАктированиеЗарплата.Исполнитель,
	              |	мАктированиеЗарплата.КТУ,
	              |	мАктированиеЗарплата.ОбъектРабот КАК ОбъектРабот,
	              |	мАктированиеЗарплата.ЭтапДоговора.Владелец.ВидДокумента КАК ВидДоговора,
	              |	мАктированиеЗарплата.НомерСтроки КАК НомерСтроки
	              |ИЗ
	              |	Документ.мАктирование.Зарплата КАК мАктированиеЗарплата
	              |ГДЕ
	              |	мАктированиеЗарплата.Ссылка = &Ссылка
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	НомерСтроки
	              |ИТОГИ ПО
	              |	ЭтапДоговора
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ РАЗЛИЧНЫЕ
	              |	мАктированиеЗарплата.ЭтапДоговора.Владелец КАК Договор,
	              |	мАктированиеЗарплата.Исполнитель,
	              |	мАктированиеЗарплата.НомерСтроки КАК НомерСтроки
	              |ИЗ
	              |	Документ.мАктирование.Зарплата КАК мАктированиеЗарплата
	              |ГДЕ
	              |	мАктированиеЗарплата.Ссылка = &Ссылка
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	НомерСтроки
	              |ИТОГИ ПО
	              |	Договор
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	мАктированиеАкты.Ссылка.Дата КАК Период,
	              |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	              |	мЭтапыДоговоровНоменклатура.НоменклатураПроизводства,
	              |	мЭтапыДоговоровНоменклатура.Калькуляция,
	              |	мЭтапыДоговоровНоменклатура.Количество,
	              |	мАктированиеАкты.ЭтапДоговора
	              |ИЗ
	              |	Документ.мАктирование.Акты КАК мАктированиеАкты
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.мЭтапыДоговоров.Номенклатура КАК мЭтапыДоговоровНоменклатура
	              |		ПО мАктированиеАкты.ЭтапДоговора = мЭтапыДоговоровНоменклатура.Ссылка
	              |ГДЕ
	              |	мАктированиеАкты.Ссылка = &Ссылка
	              |	И НЕ мЭтапыДоговоровНоменклатура.Ссылка.ПометкаУдаления
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	мЭтапыДоговоровИсполнители.Исполнитель,
	              |	мЭтапыДоговоровИсполнители.ОбъектРабот КАК ОбъектРабот,
	              |	мЭтапыДоговоровИсполнители.Ссылка КАК ЭтапДоговора
	              |ИЗ
	              |	Документ.мАктирование.Акты КАК мАктированиеАкты
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.мЭтапыДоговоров.Исполнители КАК мЭтапыДоговоровИсполнители
	              |		ПО мАктированиеАкты.ЭтапДоговора = мЭтапыДоговоровИсполнители.Ссылка
	              |ГДЕ
	              |	мАктированиеАкты.Ссылка = &Ссылка
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	мАктированиеАкты.ЭтапДоговора
	              |ПОМЕСТИТЬ ЭтапыГКИ
	              |ИЗ
	              |	Документ.мАктирование.Акты КАК мАктированиеАкты
	              |ГДЕ
	              |	мАктированиеАкты.Ссылка = &Ссылка
	              |	И мАктированиеАкты.Договор.ВидДокумента = &ВидДоговораГКИ
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	мЭтапыДоговоровОбъектыРабот.ОбъектРабот,
	              |	мЭтапыДоговоровОбъектыРабот.ВидРабот,
	              |	мЭтапыДоговоровОбъектыРабот.Смета,
	              |	мЭтапыДоговоровОбъектыРабот.Ссылка.Владелец КАК Договор
	              |ПОМЕСТИТЬ Сметы
	              |ИЗ
	              |	Справочник.мЭтапыДоговоров.ОбъектыРабот КАК мЭтапыДоговоровОбъектыРабот
	              |ГДЕ
	              |	мЭтапыДоговоровОбъектыРабот.Ссылка В
	              |			(ВЫБРАТЬ
	              |				ЭтапыГКИ.ЭтапДоговора
	              |			ИЗ
	              |				ЭтапыГКИ КАК ЭтапыГКИ)
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	              |	Сметы.ОбъектРабот КАК ОбъектРабот,
	              |	Сметы.ВидРабот КАК ВидРабот,
	              |	Сметы.Договор КАК Договор,
	              |	Сметы.Смета КАК Смета,
	              |	мСметыОбъемРабот.СтадияРабот КАК СтадияРабот,
	              |	СУММА(мСметыОбъемРабот.Стоимость) КАК Сумма,
	              |	МАКСИМУМ(Сметы.Смета.НДС) КАК НДС,
	              |	мАктирование.Дата КАК Период
	              |ИЗ
	              |	Сметы КАК Сметы
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.мСметы.ОбъемРабот КАК мСметыОбъемРабот
	              |		ПО Сметы.Смета = мСметыОбъемРабот.Ссылка,
	              |	Документ.мАктирование КАК мАктирование
	              |ГДЕ
	              |	мСметыОбъемРабот.Стоимость > 0
	              |	И мАктирование.Ссылка = &Ссылка
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	Сметы.ОбъектРабот,
	              |	Сметы.ВидРабот,
	              |	Сметы.Договор,
	              |	Сметы.Смета,
	              |	мСметыОбъемРабот.СтадияРабот,
	              |	мАктирование.Дата
	              |ИТОГИ
	              |	МАКСИМУМ(ВидРабот),
	              |	МАКСИМУМ(Договор),
	              |	МАКСИМУМ(Смета),
	              |	МАКСИМУМ(СтадияРабот),
	              |	СУММА(Сумма),
	              |	МАКСИМУМ(НДС),
	              |	МАКСИМУМ(Период)
	              |ПО
	              |	ОбъектРабот";
				  
	Результат = Запрос.ВыполнитьПакет();
  
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", Результат[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаУчетДоговоров", Результат[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаДатыДоговоров", Результат[1].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаНачислениеЗП", Результат[4].Выгрузить());
	ТаблицыДляДвижений.Вставить("ВыборкаИсполнителей", Результат[5]);
	ТаблицыДляДвижений.Вставить("ВыборкаИсполнителейПоДоговорам", Результат[6]);
	ТаблицыДляДвижений.Вставить("ТаблицаНоменклатураПроизводства", Результат[7].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаИсполнителейЭтапов", Результат[8].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаСмет", Результат[11].Выгрузить());
		
КонецПроцедуры
